<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 1,
            'author' => "Соломко Анатолій",
            'title' => "Корсетна майстерня пані Марії",
            'description' => "У повісті українського радянського журналіста розповідається про героїчну боротьбу київських більшовиків-підпільників у буремний 1905 рік.В повести украинского советского журналиста рассказывается о героической борьбе киевских большевиков-подполыциков в бурный 1905 год. Мужественным революционерам активно помогали их дети — отважные юные герои. Опираясь на реальные факты, автор воссоздает картину революционного подъема трудящихся масс.",
            'year' => 1984,
            'publish' => 'Харкiв',
            'price' => 90.50,
            'image_path' => 'book1.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 1,
            'author' => "Косідовський Зенон",
            'title' => "Біблійні оповіді",
            'description' => "Відомий польський письменник знайомить з досягненнями біблійної критики - науки, що займається вивченням Біблії. На основі найновніших даних історії, археології, літературознавства та інших наук він доводить. що Біблія - літературна памятка стародавні євреїв.",
            'year' => 1978,
            'publish' => 'Харкiв',
            'price' => 120.00,
            'image_path' => 'book2.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 1,
            'author' => "Заверуха Б.В.",
            'title' => "Квіти дванадцяти місяців",
            'description' => "У книжці розповідається про дикорослі рослини, що радують людину своєю красою в період цвітіння або плодоношення в лісах, на полях, луках; про їх цікаві біологічні особливості, можливість культивування і практичного використання.",
            'year' => 1974,
            'price' => 120.00,
            'image_path' => 'book3.jpeg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 1,
            'author' => "Власюк С.Г.",
            'title' => "Слива та алича",
            'description' => "Вид. «Урожай», Київ, 1989р. Формат 84х108/32, 152 ст. з ілюстраціями., тверда обкладинка. Книга у хорошому стані. Викладено господарські та біологічні особливості сливитаі аличі, виробнича характеристика промислових і перспективних сортів, передова агротехніка вирощування посадкового матеріалу сливи і аличі, вибір ділянки та підготовка грунту, підбір сортів, раціональне розміщення дерев, способи формування та обрізки крон, механізація виробничих процесів, захист насаджень від шкідників і хвороб, а також агротехніка цих культур в присадибних і колективних садах.",
            'year' => 1989,
            'price' => 150.00,
            'image_path' => 'book4.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 2,
            'author' => "Макконел Брю",
            'title' => "Книга Экономикс: принципы, проблемы и политика ",
            'description' => "Лучша книга для понимания экономических процессов. Один из наиболее популярных в американских колледжах и университетах учебник, выдержавший 11 изданий, был первым подобным изданием, переведенным и напечатанным  в 1992 г. В большинстве экономических вузов он используется в учебном процессе как базовый учебник, рекомендован в этом качестве Министерством образования для студентов вузов, обучающихся по экономическим специальностям. Учебник посвящен важнейшим проблемам экономикс: макро- и микроэкономике, национальному доходу, занятости, кредитно-финансовой и налоговой политике, мировому хозяйству и др. Дана книга є перекладом останнього, 11-го видання, значно доповненого і принципово переробленого у порівнянні з попереднім. Для студентів економічних вузів і всіх, хто цікавиться проблемами сучасної ринкової економіки.",
            'price' => 2000.00,
            'publish' => 'Харкiв',
            'image_path' => 'book5.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 2,
            'author' => "Багряний Іван",
            'title' => "Тигролови",
            'description' => "Роман \"Тигролови\" написаний І. Багряним протягом 1943-1944 рр, на літературному конкурсі у Львові ця книга під назвою \"Звіролови\" (скорочений варіант \"Тигроловів\") розділила перше місце з повістю Тодося Осьмачки \"Старший Боярин\". Роман зразу було перекладено англійською, німецькою та голландською мовами, що свідчить про його популярність за рубежем і увагу іноземного читача до тогочасної радянської дійсності. Сюжетна канва роману побудована навколо двох постатей - Григорія Многогрішного і майора НКВС Медвина.",
            'price' => 200.00,
            'year' => 2006,
            'publish' => 'Київ',
            'image_path' => 'book6.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 3,
            'author' => "Джоан Роулинг",
            'title' => "Гарри Поттер и Философский камень",
            'description' => "Книга, покорившая мир, эталон литературы для читателей всех возрастов, синоним успеха. Книга, сделавшая Джоан Роулинг самым читаемым писателем современности. Книга, ставшая культовой уже для нескольких поколений. «Гарри Поттер и Философский камень» - история начинается.",
            'price' => 1000.00,
            'year' => 2021,
            'publish' => 'Махаон',
            'image_path' => 'book7.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 3,
            'author' => "Федор Достоевский",
            'title' => "Преступление и наказание",
            'price' => 50.99,
            'year' => 2020,
            'publish' => 'Азбука',
            'image_path' => 'book8.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);

        DB::table('books')->insert([
            'userId' => 3,
            'cityId' => 3,
            'author' => "Андре Моруа",
            'title' => "Письма незнакомке",
            'description' => "Андре Моруа, классик французской литературы XX века, автор знаменитых романизированных биографий Дюма, Бальзака, Виктора Гюго и др., считается подлинным мастером психологической прозы.",
            'price' => 250.00,
            'year' => 2020,
            'publish' => 'АСТ',
            'image_path' => 'book9.jpg',
            'created_at' => now(),
            'updated_at' => now()
        ]);
    }
}
